app/views/tasks/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.collection_select :category_id,Category.all, :id,:categoryname %>
---
SELECT "categories".* FROM "categories"

    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id,User.all, :id,:username %>
---
SELECT "users".* FROM "users"