app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("category_id", "created_at", "done", "due_date", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category_id", ""], ["created_at", "2015-12-25 06:42:37.906361"], ["done", "f"], ["due_date", "2015-12-25"], ["name", "test"], ["updated_at", "2015-12-25 06:42:37.906361"], ["user_id", ""]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "category_id" = ?, "done" = ?, "name" = ?, "updated_at" = ?, "user_id" = ? WHERE "tasks"."id" = 1  [["category_id", "1"], ["done", "t"], ["name", "テスト"], ["updated_at", "2015-12-25 06:43:14.829361"], ["user_id", "1"]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    @task.destroy

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."name" = ''
---
  def search
    @search_book = params["search_book"]
    @tasks = Task.where("name LIKE '%#{params["search_book"]}%'")

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_task
      @task = Task.find(params[:id])